import React from 'react';
import styles from './ErrorComponent.module.css';

function ErrorComponent() {
	return (
		<div className={styles.error__component}>
			<span className={styles.error__text}>
				Произошла ошибка. Попробуйте снова{' '}
				<svg
					width="20"
					height="20"
					viewBox="0 0 20 20"
					fill="none"
					xmlns="http://www.w3.org/2000/svg">
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M10 2C5.58172 2 2 5.58172 2 10C2 14.4183 5.58172 18 10 18C14.4183 18 18 14.4183 18 10C18 5.58172 14.4183 2 10 2ZM0 10C0 4.47715 4.47715 0 10 0C15.5228 0 20 4.47715 20 10C20 15.5228 15.5228 20 10 20C4.47715 20 0 15.5228 0 10ZM6 8C6 7.44772 6.44772 7 7 7H7.01C7.56228 7 8.01 7.44772 8.01 8C8.01 8.55228 7.56228 9 7.01 9H7C6.44772 9 6 8.55228 6 8ZM12 8C12 7.44772 12.4477 7 13 7H13.01C13.5623 7 14.01 7.44772 14.01 8C14.01 8.55228 13.5623 9 13.01 9H13C12.4477 9 12 8.55228 12 8ZM12.1214 14.8787C10.9498 13.7072 9.05031 13.7072 7.87874 14.8787C7.48821 15.2693 6.85505 15.2693 6.46452 14.8787C6.074 14.4882 6.074 13.855 6.46452 13.4645C8.41715 11.5119 11.583 11.5119 13.5356 13.4645C13.9261 13.855 13.9261 14.4882 13.5356 14.8787C13.1451 15.2693 12.5119 15.2693 12.1214 14.8787Z"
						fill="#3B454E"
					/>
				</svg>
			</span>
		</div>
	);
}

export default ErrorComponent;
